#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/aws-terraform-2-tier-webapp/runs/run-SMJokSRcakKNjjJx

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
tls_private_key.main: Refreshing state... [id=ade3a0749cb43f1076721c4d9d6aca39e8a65130]
module.alb.random_id.suffix: Refreshing state... [id=wuSXJw]
local_file.private_key: Refreshing state... [id=c96179a5bbf72a88f0d813cd1ce29d3a1b98b708]
aws_key_pair.generated_key: Refreshing state... [id=project-key]
module.ec2.aws_cloudwatch_log_group.app_log_group: Refreshing state... [id=/aws/ec2/webapp-logs]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-086fb0ce971e4169a]
module.alb.data.aws_elb_service_account.main: Reading...
module.ec2.data.aws_ami.latest_amazon_linux: Reading...
module.vpc.aws_cloudwatch_log_group.flow_log_group: Refreshing state... [id=/aws/vpc/flow-logs-debug]
module.ec2.aws_iam_role.ec2_cloudwatch_role: Refreshing state... [id=ec2-cloudwatch-role]
module.vpc.data.aws_caller_identity.current: Reading...
module.vpc.aws_iam_role.flow_log_role: Refreshing state... [id=vpc-flow-log-role]
module.alb.aws_s3_bucket.alb_logs: Refreshing state... [id=my-alb-debug-logs-c2e49727]
module.alb.data.aws_elb_service_account.main: Read complete after 0s [id=127311923021]
module.vpc.data.aws_caller_identity.current: Read complete after 0s [id=871308866502]
module.ec2.aws_ssm_parameter.cw_agent_config: Refreshing state... [id=AmazonCloudWatch-linux-webapp]
module.ec2.aws_iam_role_policy_attachment.cw_policy: Refreshing state... [id=ec2-cloudwatch-role-20260211152427139000000001]
module.ec2.aws_iam_role_policy_attachment.ssm_policy: Refreshing state... [id=ec2-cloudwatch-role-20260211152427187900000002]
module.ec2.aws_iam_instance_profile.ec2_profile: Refreshing state... [id=ec2-cloudwatch-profile]
module.vpc.aws_iam_role_policy.flow_log_policy: Refreshing state... [id=vpc-flow-log-role:vpc-flow-log-policy]
module.alb.aws_s3_bucket_public_access_block.alb_logs_public_access_block: Refreshing state... [id=my-alb-debug-logs-c2e49727]
module.alb.aws_s3_bucket_policy.alb_log_policy: Refreshing state... [id=my-alb-debug-logs-c2e49727]
module.alb.aws_s3_bucket_versioning.alb_logs_versioning: Refreshing state... [id=my-alb-debug-logs-c2e49727]
module.alb.aws_s3_bucket_server_side_encryption_configuration.alb_logs_encryption: Refreshing state... [id=my-alb-debug-logs-c2e49727]
module.alb.aws_s3_bucket_lifecycle_configuration.log_lifecycle: Refreshing state... [id=my-alb-debug-logs-c2e49727]
module.ec2.data.aws_ami.latest_amazon_linux: Read complete after 1s [id=ami-02b86da1e539b4dd0]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-0cf2d1e5b85e08b07]
module.vpc.aws_flow_log.vpc_debug_logs: Refreshing state... [id=fl-09f8c794bc80a027b]
module.vpc.aws_default_security_group.default: Refreshing state... [id=sg-0ee3e2c9d89adfa66]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b139ed01ac7510ae]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0517fe667269a3935]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-00f998dccf245025e]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0cfc494a3524b6275]
module.security_groups.aws_security_group.alb_sg: Refreshing state... [id=sg-0224e75e14ba1dfad]
module.alb.aws_lb_target_group.app_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:871308866502:targetgroup/app-tg20260211152438531600000004/f384c797214dbd5a]
module.vpc.aws_route_table.public_rt: Refreshing state... [id=rtb-025f3c196ebab0ced]
module.security_groups.aws_security_group.ec2_sg: Refreshing state... [id=sg-08f280b8004b487e5]
module.alb.aws_lb.application_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:871308866502:loadbalancer/app/webapp-2-tier-alb/35f227d845960894]
module.rds.aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=main-rds-subnet-group]
module.vpc.aws_route_table_association.public_assoc[1]: Refreshing state... [id=rtbassoc-094c832b640320122]
module.vpc.aws_route_table_association.public_assoc[0]: Refreshing state... [id=rtbassoc-0f0fc303a768c5d5b]
module.security_groups.aws_security_group.rds_sg: Refreshing state... [id=sg-07a5da8823cc6b4cc]
module.rds.aws_db_instance.mysql: Refreshing state... [id=db-PBHMI66SBZLWAUSOJJECAZFDGE]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:871308866502:listener/app/webapp-2-tier-alb/35f227d845960894/1a2769ef06a7d6e4]
module.ec2.aws_launch_template.app_lt: Refreshing state... [id=lt-0ad459c8617cf359d]
module.ec2.aws_autoscaling_group.app_asg: Refreshing state... [id=webapp-asg]
module.ec2.data.aws_instances.asg_instances: Reading...
module.ec2.data.aws_instances.asg_instances: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0400"
      + filename             = "./project-key.pem"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + selected_ami_id      = "ami-02b86da1e539b4dd0"
  + selected_ami_name    = "al2023-ami-2023.10.20260202.2-kernel-6.1-arm64"

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 9 estimated
           $34.4888000000000016/mo +$0.0

```

</details>